openocd-org/openocd/src/flash/nand/lpc3180.c
			if (!lpc3180_tc_ready(nand, 1000)) {
				LOG_ERROR("timeout while waiting for completion of DMA");
				return ERROR_NAND_OPERATION_FAILED;
			}

			target_free_working_area(target, pworking_area);

			LOG_INFO("Page =  0x%" PRIx32 " was written.", page);

		} else
			return nand_write_page_raw(nand, page, data, data_size, oob, oob_size);
	}

	return ERROR_OK;
}

static int lpc3180_read_page(struct nand_device *nand,
	uint32_t page,
	uint8_t *data,
	uint32_t data_size,
	uint8_t *oob,
	uint32_t oob_size)
{
	struct lpc3180_nand_controller *lpc3180_info = nand->controller_priv;
	struct target *target = nand->target;
	uint8_t *page_buffer;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC3180 NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc3180_info->selected_controller == LPC3180_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC3180 NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc3180_info->selected_controller == LPC3180_MLC_CONTROLLER) {
		uint8_t *oob_buffer;
		uint32_t page_bytes_done = 0;
		uint32_t oob_bytes_done = 0;
		uint32_t mlc_isr;

#if 0
		if (oob && (oob_size > 6)) {
			LOG_ERROR("LPC3180 MLC controller can't read more than 6 bytes of OOB data");
			return ERROR_NAND_OPERATION_NOT_SUPPORTED;
		}
#endif

		if (data_size > (uint32_t)nand->page_size) {
			LOG_ERROR("data size exceeds page size");
			return ERROR_NAND_OPERATION_NOT_SUPPORTED;
		}

		if (nand->page_size == 2048) {
			page_buffer = malloc(2048);
			oob_buffer = malloc(64);
		} else {
			page_buffer = malloc(512);
			oob_buffer = malloc(16);
		}

		if (!data && oob) {
			/* MLC_CMD = Read OOB
			 * we can use the READOOB command on both small and large page devices,
			 * as the controller translates the 0x50 command to a 0x0 with appropriate
			 * positioning of the serial buffer read pointer
			 */
			target_write_u32(target, 0x200b8000, NAND_CMD_READOOB);
		} else {
			/* MLC_CMD = Read0 */
			target_write_u32(target, 0x200b8000, NAND_CMD_READ0);
		}

		if (nand->page_size == 512) {
			/* small page device
			 * MLC_ADDR = 0x0 (one column cycle) */
			target_write_u32(target, 0x200b8004, 0x0);

			/* MLC_ADDR = row */
			target_write_u32(target, 0x200b8004, page & 0xff);
			target_write_u32(target, 0x200b8004, (page >> 8) & 0xff);

			if (nand->address_cycles == 4)
				target_write_u32(target, 0x200b8004, (page >> 16) & 0xff);
		} else {
			/* large page device
			 * MLC_ADDR = 0x0 (two column cycles) */
			target_write_u32(target, 0x200b8004, 0x0);
			target_write_u32(target, 0x200b8004, 0x0);

			/* MLC_ADDR = row */
			target_write_u32(target, 0x200b8004, page & 0xff);
			target_write_u32(target, 0x200b8004, (page >> 8) & 0xff);

			/* MLC_CMD = Read Start */
			target_write_u32(target, 0x200b8000, NAND_CMD_READSTART);
		}

		while (page_bytes_done < (uint32_t)nand->page_size) {
			/* MLC_ECC_AUTO_DEC_REG = dummy */
			target_write_u32(target, 0x200b8014, 0xaa55aa55);

			if (!lpc3180_controller_ready(nand, 1000)) {
				LOG_ERROR("timeout while waiting for completion of auto decode cycle");
				free(page_buffer);
				free(oob_buffer);
				return ERROR_NAND_OPERATION_FAILED;
			}

			target_read_u32(target, 0x200b8048, &mlc_isr);

			if (mlc_isr & 0x8) {
				if (mlc_isr & 0x40) {
					LOG_ERROR("uncorrectable error detected: 0x%2.2" PRIx32, mlc_isr);
					free(page_buffer);
					free(oob_buffer);
					return ERROR_NAND_OPERATION_FAILED;
				}

				LOG_WARNING("%i symbol error detected and corrected",
					((int)(((mlc_isr & 0x30) >> 4) + 1)));
			}

			if (data)
				target_read_memory(target,
					0x200a8000,
					4,
					128,
					page_buffer + page_bytes_done);

			if (oob)
				target_read_memory(target,
					0x200a8000,
					4,
					4,
					oob_buffer + oob_bytes_done);

			page_bytes_done += 512;
			oob_bytes_done += 16;
		}

		if (data)
			memcpy(data, page_buffer, data_size);

		if (oob)
			memcpy(oob, oob_buffer, oob_size);

		free(page_buffer);
		free(oob_buffer);
	} else if (lpc3180_info->selected_controller == LPC3180_SLC_CONTROLLER) {

		/**********************************************************************
		*     Read both SLC NAND flash page main area and spare area.
		*     Small page -
		*      ------------------------------------------
		*     |    512 bytes main   |   16 bytes spare   |
		*      ------------------------------------------
		*     Large page -
		*      ------------------------------------------
		*     |   2048 bytes main   |   64 bytes spare   |
		*      ------------------------------------------
		*     If DMA & ECC enabled, then the ECC generated for the 1st 256-byte
		*     data is compared with the 3rd word of the spare area. The ECC
		*     generated for the 2nd 256-byte data is compared with the 4th word
		*     of the spare area. The ECC generated for the 3rd 256-byte data is
		*     compared with the 7th word of the spare area. The ECC generated
		*     for the 4th 256-byte data is compared with the 8th word of the
		*     spare area and so on.
		*
		**********************************************************************/

		int retval, i, target_mem_base;
		uint8_t *ecc_hw_buffer;
		uint8_t *ecc_flash_buffer;
		struct working_area *pworking_area;

		if (lpc3180_info->is_bulk) {

			/* read always the data and also oob areas*/

			retval = nand_page_command(nand, page, NAND_CMD_READ0, 0);
			if (retval != ERROR_OK)
				return retval;

			/* allocate a working area */
			if (target->working_area_size < (uint32_t) nand->page_size + 0x200) {
				LOG_ERROR("Reserve at least 0x%x physical target working area",
					nand->page_size + 0x200);
				return ERROR_FLASH_OPERATION_FAILED;
			}
			if (target->working_area_phys%4) {
				LOG_ERROR(
					"Reserve the physical target working area at word boundary");
				return ERROR_FLASH_OPERATION_FAILED;
			}
			if (target_alloc_working_area(target, target->working_area_size,
				    &pworking_area) != ERROR_OK) {
				LOG_ERROR("no working area specified, can't read LPC internal flash");
				return ERROR_FLASH_OPERATION_FAILED;
			}
			target_mem_base = target->working_area_phys;

