openocd-org/openocd/src/flash/nand/lpc3180.c
			if (nand->page_size == 2048)
				page_buffer = malloc(2048);
			else
				page_buffer = malloc(512);

			ecc_hw_buffer = malloc(32);
			ecc_flash_buffer = malloc(64);

			/* SLC_CFG = 0x (Force nCE assert, DMA ECC enabled, ECC enabled, DMA burst
			 *enabled, DMA read from SLC, WIDTH = bus_width) */
			target_write_u32(target, 0x20020014, 0x3e);

			/* set DMA LLI-s in target memory and in DMA*/
			for (i = 0; i < nand->page_size/0x100; i++) {
				int tmp;
				/* -------LLI for 256 byte block---------
				 * DMACC0SrcAddr = SLC_DMA_DATA*/
				target_write_u32(target, target_mem_base+0+i*32, 0x20020038);
				if (i == 0)
					target_write_u32(target, 0x31000100, 0x20020038);
				/* DMACCxDestAddr = SRAM */
				target_write_u32(target,
					target_mem_base+4+i*32,
					target_mem_base+DATA_OFFS+i*256);
				if (i == 0)
					target_write_u32(target,
						0x31000104,
						target_mem_base+DATA_OFFS);
				/* DMACCxLLI = next element */
				tmp = (target_mem_base+(1+i*2)*16)&0xfffffffc;
				target_write_u32(target, target_mem_base+8+i*32, tmp);
				if (i == 0)
					target_write_u32(target, 0x31000108, tmp);
				/* DMACCxControl =  TransferSize =64, Source burst size =16,
				 * Destination burst size = 16, Source transfer width = 32 bit,
				 * Destination transfer width = 32 bit, Source AHB master select = M0,
				 * Destination AHB master select = M0, Source increment = 0,
				 * Destination increment = 1, Terminal count interrupt enable bit = 0*/
				target_write_u32(target,
					target_mem_base+12+i*32,
					0x40 | 3<<12 | 3<<15 | 2<<18 | 2<<21 | 0<<24 | 0<<25 | 0<<26 | 1<<27 | 0<<
					31);
				if (i == 0)
					target_write_u32(target,
						0x3100010c,
						0x40 | 3<<12 | 3<<15 | 2<<18 | 2<<21 | 0<<24 | 0<<25 | 0<<26 | 1<<27 | 0<<
						31);

				/* -------LLI for 3 byte ECC---------
				 * DMACC0SrcAddr = SLC_ECC*/
				target_write_u32(target, target_mem_base+16+i*32, 0x20020034);
				/* DMACCxDestAddr = SRAM */
				target_write_u32(target,
					target_mem_base+20+i*32,
					target_mem_base+ECC_OFFS+i*4);
				/* DMACCxLLI = next element */
				tmp = (target_mem_base+(2+i*2)*16)&0xfffffffc;
				target_write_u32(target, target_mem_base+24+i*32, tmp);
				/* DMACCxControl =  TransferSize =1, Source burst size =4,
				 * Destination burst size = 4, Source transfer width = 32 bit,
				 * Destination transfer width = 32 bit, Source AHB master select = M0,
				 * Destination AHB master select = M0, Source increment = 0,
				 * Destination increment = 1, Terminal count interrupt enable bit = 0*/
				target_write_u32(target,
					target_mem_base+28+i*32,
					0x01 | 1<<12 | 1<<15 | 2<<18 | 2<<21 | 0<<24 | 0<<25 | 0<<26 | 1<<27 | 0<<
					31);
			}

			/* -------LLI for spare area---------
			 * DMACC0SrcAddr = SLC_DMA_DATA*/
			target_write_u32(target, target_mem_base+0+i*32, 0x20020038);
			/* DMACCxDestAddr = SRAM */
			target_write_u32(target, target_mem_base+4+i*32, target_mem_base+SPARE_OFFS);
			/* DMACCxLLI = next element = NULL */
			target_write_u32(target, target_mem_base+8+i*32, 0);
			/* DMACCxControl =  TransferSize =16 for large page or 4 for small page,
			 * Source burst size =16, Destination burst size = 16, Source transfer width = 32 bit,
			 * Destination transfer width = 32 bit, Source AHB master select = M0,
			 * Destination AHB master select = M0, Source increment = 0,
			 * Destination increment = 1, Terminal count interrupt enable bit = 0*/
			target_write_u32(target,
				target_mem_base + 12 + i * 32,
				(nand->page_size == 2048 ? 0x10 : 0x04) | 3<<12 | 3<<15 | 2<<18 | 2<<21 |
			 0<<24 | 0<<25 | 0<<26 | 1<<27 | 0<<31);

			/* Enable DMA after channel set up !
			    LLI only works when DMA is the flow controller!
			*/
			/* DMACCxConfig= E=1, SrcPeripheral = 1 (SLC), DestPeripheral = 1 (SLC),
			 *FlowCntrl = 2 (Pher-> Mem, DMA), IE = 0, ITC = 0, L= 0, H=0*/
			target_write_u32(target,
				0x31000110,
				1 | 1<<1 | 1<<6 |  2<<11 | 0<<14 | 0<<15 | 0<<16 | 0<<18);

			/* SLC_CTRL = 3 (START DMA), ECC_CLEAR */
			target_write_u32(target, 0x20020010, 0x3);

			/* SLC_ICR = 2, INT_TC_CLR, clear pending TC*/
			target_write_u32(target, 0x20020028, 2);

			/* SLC_TC */
			target_write_u32(target, 0x20020030,
				(nand->page_size == 2048 ? 0x840 : 0x210));

			if (!lpc3180_tc_ready(nand, 1000)) {
				LOG_ERROR("timeout while waiting for completion of DMA");
				free(page_buffer);
				free(ecc_hw_buffer);
				free(ecc_flash_buffer);
				target_free_working_area(target, pworking_area);
				return ERROR_NAND_OPERATION_FAILED;
			}

			if (data) {
				target_read_memory(target,
					target_mem_base+DATA_OFFS,
					4,
					nand->page_size == 2048 ? 512 : 128,
					page_buffer);
				memcpy(data, page_buffer, data_size);

				LOG_INFO("Page =  0x%" PRIx32 " was read.", page);

				/* check hw generated ECC for each 256 bytes block with the saved
				 *ECC in flash spare area*/
				int idx = nand->page_size/0x200;
				target_read_memory(target,
					target_mem_base+SPARE_OFFS,
					4,
					16,
					ecc_flash_buffer);
				target_read_memory(target,
					target_mem_base+ECC_OFFS,
					4,
					8,
					ecc_hw_buffer);
				for (i = 0; i < idx; i++) {
					if ((0x00ffffff & *(uint32_t *)(void *)(ecc_hw_buffer+i*8)) !=
							(0x00ffffff & *(uint32_t *)(void *)(ecc_flash_buffer+8+i*16)))
						LOG_WARNING(
							"ECC mismatch at 256 bytes size block= %d at page= 0x%" PRIx32,
							i * 2 + 1, page);
					if ((0x00ffffff & *(uint32_t *)(void *)(ecc_hw_buffer+4+i*8)) !=
							(0x00ffffff & *(uint32_t *)(void *)(ecc_flash_buffer+12+i*16)))
						LOG_WARNING(
							"ECC mismatch at 256 bytes size block= %d at page= 0x%" PRIx32,
							i * 2 + 2, page);
				}
			}

			if (oob)
				memcpy(oob, ecc_flash_buffer, oob_size);

			free(page_buffer);
			free(ecc_hw_buffer);
			free(ecc_flash_buffer);

			target_free_working_area(target, pworking_area);

		} else
			return nand_read_page_raw(nand, page, data, data_size, oob, oob_size);
	}

	return ERROR_OK;
}

static int lpc3180_controller_ready(struct nand_device *nand, int timeout)
{
	struct lpc3180_nand_controller *lpc3180_info = nand->controller_priv;
	struct target *target = nand->target;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC3180 NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	LOG_DEBUG("lpc3180_controller_ready count start=%d", timeout);

	do {
		if (lpc3180_info->selected_controller == LPC3180_MLC_CONTROLLER) {
			uint8_t status;

